In [1]:
import numpy as np
import pandas as pd

In [2]:
np.random.randint(0,50,(5,5))

array([[37, 14, 27, 10, 38],
       [ 8, 13, 25, 14, 29],
       [10, 24, 31,  1, 36],
       [14, 43, 11,  3, 22],
       [46, 28,  1, 48, 30]])

In [3]:
df=pd.DataFrame(np.random.randint(0,50,(5,5)),columns=['Roll','Id','Reg','Tag','Govt'])

In [4]:
df

   Roll  Id  Reg  Tag  Govt
0    49  44   25   20    39
1    35  43   35    0     5
2    25  26    4   16    33
3    28  29   34   15     2
4    44  16   45    7    45

In [5]:
df['Gst']=df['Roll']+df.Govt

In [6]:
df

   Roll  Id  Reg  Tag  Govt  Gst
0    49  44   25   20    39   88
1    35  43   35    0     5   40
2    25  26    4   16    33   58
3    28  29   34   15     2   30
4    44  16   45    7    45   89

# How to delete a column from the data::

* Done using drop function

In [7]:
df.drop('Id')

KeyError: "['Id'] not found in axis"

# We got this error because of axis parameter

In [ ]:

'''
Signature:
df.drop(
    labels=None,
    axis: 'Axis' = 0,
    index=None,
    columns=None,
    level: 'Level | None' = None,
    inplace: 'bool' = False,
    errors: 'str' = 'raise',
) '''

### In drop function,axis= 0 by default which means drops the labels from row-wise ..to drop the values from columns we need to exclusively specify the axis=1

In [ ]:
df

In [ ]:
# Now try to drop the label from column
df.drop('Id',axis=1)

# Now try to check the dataframe...and confirm whether the "Id" column is permanently removed

In [ ]:
df

# Note here we can see that the "Id" still exists.......to drop any label permanently we need to specify the inplace parameter =True

In [ ]:
df

In [ ]:
df.drop('Id',axis=1,inplace=True)

In [ ]:
df # Now there won't be any Id column

# How to drop row::

In [ ]:
# Note: Even without using inplace we can make permanent changes......it is by storing the dataframe

df=df.drop(3,axis=0) # Here we have not used inplace parameter

In [ ]:
df

In [ ]:
df

# Create a random dataset::

In [ ]:
np.random.randint(0,50,(5,5))

In [ ]:
np.random.rand(4,5)

# Note the differnces between the above two line of code

### Now convert the data into dataframe

In [ ]:
pd.DataFrame(np.random.rand(4,5))

# Give your own indexes and column names

In [ ]:
pd.DataFrame(np.random.rand(4,5),index=['A','B','C','D'],columns=['X','Y','Z','P','Q'])

In [ ]:
# I am using the same above code and run
pd.DataFrame(np.random.rand(4,5),index=['A','B','C','D'],columns=['X','Y','Z','P','Q'])

# Very important:: Note the differnce in the outputs of same code

* In order to get the same values as an output we need to use "SEED"



* Seed function is used to save the state of a random function, so that it can generate same random numbers on multiple executions of the code on the same machine or on different machines

In [ ]:
np.random.seed(23)
df=pd.DataFrame(np.random.rand(4,5),index=['A','B','C','D'],columns=['X','Y','Z','P','Q'])

In [ ]:
df

In [ ]:
df

# How to get some negative values in the dataset which is randomly generated??

* use randn(value,value)

In [ ]:
np.random.seed(23)
df=pd.DataFrame(np.random.randn(4,5),index=['A','B','C','D'],columns=['X','Y','Z','P','Q'])

In [ ]:
df # Here we can see some negative values in the dataset

In [ ]:
df

# Task::-Extract all the negative values which are in the above dataset

In [ ]:
df

In [ ]:
df.values # First get all the values in the dataframe

In [ ]:
df.values[df.values<0] # Now filter the negative values

In [ ]:
# Another way of doing the same::
df.values[df.iloc[0:5]<0]

In [ ]:
# Another way of doing the same::
df.values[df.loc['A':'D']<0]

# Task::

* print the row name and column name of above output

In [ ]:
df.columns

In [ ]:
df.index

In [ ]:
# 1st way
for i in df.columns:
    for j in df.index:
        if df.loc[j,i]<0:
            print(i,j,df.loc[j,i])

In [ ]:
# 2nd way
for i in df.columns:
    for j in df.index:
        for k in df.values[df.values<0]:
            print(k,"=====>",(i,j))

In [ ]:
for k in df.values[df.values<0]:
            print(k)

# How to create a dataframe using DICTIONARY

In [ ]:
d={'Key1':[1,2,3,4,5],'Key2':[12,13,15,14,16],'Key3':[20,21,22,23,24]}
pd.DataFrame(d)

In [ ]:
# Create another dictionary with null values
d={'Key1':[1,2,3,np.nan,np.nan],'Key2':[12,13,np.nan,np.nan,np.nan],'Key3':[20,21,22,23,24]}
df12=pd.DataFrame(d)

In [ ]:
df12

# Using dropna function::

* The dropna() method removes the rows that contains NULL values

In [ ]:
df12.dropna()

In [ ]:
# Here by default axis =0----so by default it works only for rows
'''
Signature:
df12.dropna(
    axis: 'Axis' = 0,
    how: 'str' = 'any',
    thresh=None,
    subset=None,
    inplace: 'bool' = False,
)
'''

# To remove the null values through the column wise....use Axis=1

In [ ]:
df12

In [ ]:
df12.dropna(axis=1) # This removes the columns whichever has null values

# Using thresh funtion in dropna::


* thresh: thresh takes integer value which tells minimum amount of na values to drop.

In [9]:
d={'Key1':[1,2,3,np.nan,np.nan],'Key2':[12,13,np.nan,np.nan,np.nan],'Key3':[20,21,22,23,24],'Key4':[np.nan,np.nan,np.nan,np.nan,np.nan]}
df123=pd.DataFrame(d)

In [10]:
df123

   Key1  Key2  Key3  Key4
0   1.0  12.0    20   NaN
1   2.0  13.0    21   NaN
2   3.0   NaN    22   NaN
3   NaN   NaN    23   NaN
4   NaN   NaN    24   NaN

In [11]:
df123.dropna(thresh=0)

   Key1  Key2  Key3  Key4
0   1.0  12.0    20   NaN
1   2.0  13.0    21   NaN
2   3.0   NaN    22   NaN
3   NaN   NaN    23   NaN
4   NaN   NaN    24   NaN

In [12]:
df123.dropna(thresh=1)
# Here it drops the rows whichever don't have atleast one non-na values

   Key1  Key2  Key3  Key4
0   1.0  12.0    20   NaN
1   2.0  13.0    21   NaN
2   3.0   NaN    22   NaN
3   NaN   NaN    23   NaN
4   NaN   NaN    24   NaN

In [13]:
df123.dropna(thresh=2)
# Here it drops the row which don't have atleast two non-na values

   Key1  Key2  Key3  Key4
0   1.0  12.0    20   NaN
1   2.0  13.0    21   NaN
2   3.0   NaN    22   NaN

In [14]:
df123.dropna(thresh=3)
# Here it drops the row whichever doesn't have 3 non-na values

   Key1  Key2  Key3  Key4
0   1.0  12.0    20   NaN
1   2.0  13.0    21   NaN

In [15]:
df123

   Key1  Key2  Key3  Key4
0   1.0  12.0    20   NaN
1   2.0  13.0    21   NaN
2   3.0   NaN    22   NaN
3   NaN   NaN    23   NaN
4   NaN   NaN    24   NaN